api/app/views/sensors/_form.html.erb

SELECT "locations".* FROM "locations"
---
    <%= f.label :location_id %><br>
    <%= f.collection_select :location_id, Location.all, :id, :name %>