api/app/views/values/_form.html.erb

    <%= f.label :sensor_id %><br>
    <%= f.collection_select :sensor_id, Sensor.all, :id, :viktor %>
---
SELECT "sensors".* FROM "sensors"