api/app/controllers/sensors_controller.rb

  def index
    @sensors = Sensor.all
---
SELECT "sensors".* FROM "sensors"

  def create
    @sensor = Sensor.new(sensor_params)

    respond_to do |format|
      if @sensor.save
---
INSERT INTO "sensors" ("tagname", "active", "location_id", "install_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tagname", "Yellow25"], ["active", "f"], ["location_id", 2], ["install_date", "2016-02-02"], ["created_at", "2016-02-02 21:22:58.991670"], ["updated_at", "2016-02-02 21:22:58.991670"]]

    def set_sensor
      @sensor = Sensor.find(params[:id])
---
SELECT  "sensors".* FROM "sensors" WHERE "sensors"."id" = ? LIMIT 1  [["id", 3]]