api/app/controllers/values_controller.rb

  def index
    @values = Value.all
---
SELECT "values".* FROM "values"

  def create
    @value = Value.new(value_params)

    respond_to do |format|
      if @value.save
---
INSERT INTO "values" ("temp", "sound", "light", "sensor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["temp", 19], ["sound", 775], ["light", 888], ["sensor_id", 3], ["created_at", "2016-02-02 21:24:17.800014"], ["updated_at", "2016-02-02 21:24:17.800014"]]

    def set_value
      @value = Value.find(params[:id])
---
SELECT  "values".* FROM "values" WHERE "values"."id" = ? LIMIT 1  [["id", 1]]